Австралия/src/InformationRegisters/SubstituteGoods/SubstituteGoods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SubstituteGoods</name>
  <resources>
    <name>Priority</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Analog</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/SubstituteGoods/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

#Region CloneProductRelatedData

Procedure MakeRelatedSubstituteGoods(ProductReceiver, ProductSource) Export
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	SubstituteGoods.Products AS Products,
		|	SubstituteGoods.Analog AS Analog,
		|	SubstituteGoods.Priority AS Priority,
		|	SubstituteGoods.Comment AS Comment
		|FROM
		|	InformationRegister.SubstituteGoods AS SubstituteGoods
		|WHERE
		|	SubstituteGoods.Products = &ProductSource";
	
	Query.SetParameter("ProductSource", ProductSource);
	
	QueryResult = Query.Execute();
	
	SelectionDetailRecords = QueryResult.Select();
	
	NewRecords = InformationRegisters.SubstituteGoods.CreateRecordSet();
	NewRecords.Filter.Products.Set(ProductReceiver);
	
	While SelectionDetailRecords.Next() Do
		NewRecord = NewRecords.Add();
		FillPropertyValues(NewRecord, SelectionDetailRecords,,"Products");
		NewRecord.Products = ProductReceiver;
		NewRecords.Write();
	EndDo;
	
EndProcedure

#EndRegion

#EndRegion

#EndIf
